; domain
(define (domain zeno-travel)
(:requirements :typing :negative-preconditions)
(:types aircraft person city flevel - object)
(:predicates (at ?x - person  ?c - city )
             (at_aircraft ?x - aircraft ?c - city)
             (in ?p - person ?a - aircraft)
	         (fuel-level ?a - aircraft ?l - flevel)
	         (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (at ?p ?c)
                 (at_aircraft ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at_aircraft ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)

 :precondition (and (at_aircraft ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1))
 :effect (and (not (at_aircraft ?a ?c1))
              (at_aircraft ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))

(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at_aircraft ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1)
		 (next ?l3 ?l2)
		)
 :effect (and (not (at_aircraft ?a ?c1))
              (at_aircraft ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
)

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (next ?l ?l1)
                 (at_aircraft ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))
)

; problem
(define (problem ZTRAVEL-5-60)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
	person34 - person
	person35 - person
	person36 - person
	person37 - person
	person38 - person
	person39 - person
	person40 - person
	person41 - person
	person42 - person
	person43 - person
	person44 - person
	person45 - person
	person46 - person
	person47 - person
	person48 - person
	person49 - person
	person50 - person
	person51 - person
	person52 - person
	person53 - person
	person54 - person
	person55 - person
	person56 - person
	person57 - person
	person58 - person
	person59 - person
	person60 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at_aircraft plane1 city12)
	(fuel-level plane1 fl3)
	(at_aircraft plane2 city5)
	(fuel-level plane2 fl1)
	(at_aircraft plane3 city1)
	(fuel-level plane3 fl1)
	(at_aircraft plane4 city4)
	(fuel-level plane4 fl1)
	(at_aircraft plane5 city19)
	(fuel-level plane5 fl2)
	(at person1 city14)
	(at person2 city13)
	(at person3 city17)
	(at person4 city1)
	(at person5 city4)
	(at person6 city18)
	(at person7 city18)
	(at person8 city0)
	(at person9 city0)
	(at person10 city3)
	(at person11 city8)
	(at person12 city9)
	(at person13 city3)
	(at person14 city1)
	(at person15 city1)
	(at person16 city0)
	(at person17 city2)
	(at person18 city4)
	(at person19 city14)
	(at person20 city19)
	(at person21 city0)
	(at person22 city14)
	(at person23 city6)
	(at person24 city13)
	(at person25 city14)
	(at person26 city16)
	(at person27 city9)
	(at person28 city0)
	(at person29 city12)
	(at person30 city18)
	(at person31 city0)
	(at person32 city13)
	(at person33 city11)
	(at person34 city11)
	(at person35 city14)
	(at person36 city4)
	(at person37 city1)
	(at person38 city2)
	(at person39 city8)
	(at person40 city19)
	(at person41 city19)
	(at person42 city16)
	(at person43 city0)
	(at person44 city14)
	(at person45 city0)
	(at person46 city18)
	(at person47 city10)
	(at person48 city17)
	(at person49 city4)
	(at person50 city6)
	(at person51 city2)
	(at person52 city13)
	(at person53 city13)
	(at person54 city9)
	(at person55 city14)
	(at person56 city3)
	(at person57 city13)
	(at person58 city12)
	(at person59 city1)
	(at person60 city14)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city12)
	(at person2 city17)
	(at person3 city15)
	(at person5 city0)
	(at person6 city12)
	(at person7 city17)
	(at person8 city1)
	(at person9 city12)
	(at person10 city16)
	(at person11 city11)
	(at person12 city4)
	(at person13 city1)
	(at person14 city3)
	(at person15 city7)
	(at person16 city5)
	(at person17 city4)
	(at person18 city4)
	(at person19 city5)
	(at person20 city8)
	(at person21 city17)
	(at person22 city6)
	(at person23 city9)
	(at person24 city11)
	(at person25 city13)
	(at person26 city13)
	(at person27 city15)
	(at person28 city0)
	(at person29 city14)
	(at person31 city14)
	(at person32 city9)
	(at person33 city15)
	(at person34 city9)
	(at person35 city4)
	(at person36 city0)
	(at person37 city9)
	(at person38 city10)
	(at person39 city3)
	(at person40 city1)
	(at person41 city2)
	(at person43 city7)
	(at person44 city18)
	(at person45 city12)
	(at person46 city17)
	(at person47 city18)
	(at person48 city1)
	(at person49 city9)
	(at person50 city9)
	(at person51 city8)
	(at person52 city5)
	(at person53 city6)
	(at person54 city1)
	(at person55 city1)
	(at person56 city19)
	(at person57 city10)
	(at person58 city8)
	(at person59 city13)
	(at person60 city19)
	))

)

; plan
1. (fly plane5 city19 city0 fl2 fl1)
   deleted: (at_aircraft plane5 city19) (fuel-level plane5 fl2)
   added: (at_aircraft plane5 city0) (fuel-level plane5 fl1)
   goals met: 2 of 57
2. (fly plane5 city0 city1 fl1 fl0)
   deleted: (at_aircraft plane5 city0) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city1) (fuel-level plane5 fl0)
   goals met: 2 of 57
3. (fly plane4 city4 city0 fl1 fl0)
   deleted: (at_aircraft plane4 city4) (fuel-level plane4 fl1)
   added: (at_aircraft plane4 city0) (fuel-level plane4 fl0)
   goals met: 2 of 57
4. (fly plane3 city1 city0 fl1 fl0)
   deleted: (at_aircraft plane3 city1) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city0) (fuel-level plane3 fl0)
   goals met: 2 of 57
5. (fly plane2 city5 city0 fl1 fl0)
   deleted: (at_aircraft plane2 city5) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city0) (fuel-level plane2 fl0)
   goals met: 2 of 57
6. (board person58 plane1 city12)
   deleted: (at person58 city12)
   added: (in person58 plane1)
   goals met: 2 of 57
7. (board person29 plane1 city12)
   deleted: (at person29 city12)
   added: (in person29 plane1)
   goals met: 2 of 57
8. (fly plane1 city12 city0 fl3 fl2)
   deleted: (at_aircraft plane1 city12) (fuel-level plane1 fl3)
   added: (at_aircraft plane1 city0) (fuel-level plane1 fl2)
   goals met: 2 of 57
9. (board person9 plane1 city0)
   deleted: (at person9 city0)
   added: (in person9 plane1)
   goals met: 2 of 57
10. (board person8 plane1 city0)
   deleted: (at person8 city0)
   added: (in person8 plane1)
   goals met: 2 of 57
11. (board person45 plane1 city0)
   deleted: (at person45 city0)
   added: (in person45 plane1)
   goals met: 2 of 57
12. (board person43 plane1 city0)
   deleted: (at person43 city0)
   added: (in person43 plane1)
   goals met: 2 of 57
13. (board person31 plane1 city0)
   deleted: (at person31 city0)
   added: (in person31 plane1)
   goals met: 2 of 57
14. (board person21 plane1 city0)
   deleted: (at person21 city0)
   added: (in person21 plane1)
   goals met: 2 of 57
15. (board person16 plane1 city0)
   deleted: (at person16 city0)
   added: (in person16 plane1)
   goals met: 2 of 57
16. (fly plane1 city0 city14 fl2 fl1)
   deleted: (at_aircraft plane1 city0) (fuel-level plane1 fl2)
   added: (at_aircraft plane1 city14) (fuel-level plane1 fl1)
   goals met: 2 of 57
17. (board person60 plane1 city14)
   deleted: (at person60 city14)
   added: (in person60 plane1)
   goals met: 2 of 57
18. (board person55 plane1 city14)
   deleted: (at person55 city14)
   added: (in person55 plane1)
   goals met: 2 of 57
19. (board person44 plane1 city14)
   deleted: (at person44 city14)
   added: (in person44 plane1)
   goals met: 2 of 57
20. (board person35 plane1 city14)
   deleted: (at person35 city14)
   added: (in person35 plane1)
   goals met: 2 of 57
21. (debark person31 plane1 city14)
   deleted: (in person31 plane1)
   added: (at person31 city14)
   goals met: 3 of 57
22. (debark person29 plane1 city14)
   deleted: (in person29 plane1)
   added: (at person29 city14)
   goals met: 4 of 57
23. (board person25 plane1 city14)
   deleted: (at person25 city14)
   added: (in person25 plane1)
   goals met: 4 of 57
24. (board person22 plane1 city14)
   deleted: (at person22 city14)
   added: (in person22 plane1)
   goals met: 4 of 57
25. (board person19 plane1 city14)
   deleted: (at person19 city14)
   added: (in person19 plane1)
   goals met: 4 of 57
26. (board person1 plane1 city14)
   deleted: (at person1 city14)
   added: (in person1 plane1)
   goals met: 4 of 57
27. (refuel plane1 city14 fl1 fl2)
   deleted: (fuel-level plane1 fl1)
   added: (fuel-level plane1 fl2)
   goals met: 4 of 57
28. (fly plane1 city14 city13 fl2 fl1)
   deleted: (at_aircraft plane1 city14) (fuel-level plane1 fl2)
   added: (at_aircraft plane1 city13) (fuel-level plane1 fl1)
   goals met: 4 of 57
29. (board person57 plane1 city13)
   deleted: (at person57 city13)
   added: (in person57 plane1)
   goals met: 4 of 57
30. (board person53 plane1 city13)
   deleted: (at person53 city13)
   added: (in person53 plane1)
   goals met: 4 of 57
31. (board person52 plane1 city13)
   deleted: (at person52 city13)
   added: (in person52 plane1)
   goals met: 4 of 57
32. (board person32 plane1 city13)
   deleted: (at person32 city13)
   added: (in person32 plane1)
   goals met: 4 of 57
33. (debark person25 plane1 city13)
   deleted: (in person25 plane1)
   added: (at person25 city13)
   goals met: 5 of 57
34. (board person24 plane1 city13)
   deleted: (at person24 city13)
   added: (in person24 plane1)
   goals met: 5 of 57
35. (board person2 plane1 city13)
   deleted: (at person2 city13)
   added: (in person2 plane1)
   goals met: 5 of 57
36. (refuel plane1 city13 fl1 fl2)
   deleted: (fuel-level plane1 fl1)
   added: (fuel-level plane1 fl2)
   goals met: 5 of 57
37. (fly plane1 city13 city1 fl2 fl1)
   deleted: (at_aircraft plane1 city13) (fuel-level plane1 fl2)
   added: (at_aircraft plane1 city1) (fuel-level plane1 fl1)
   goals met: 5 of 57
38. (debark person8 plane1 city1)
   deleted: (in person8 plane1)
   added: (at person8 city1)
   goals met: 6 of 57
39. (board person59 plane1 city1)
   deleted: (at person59 city1)
   added: (in person59 plane1)
   goals met: 6 of 57
40. (debark person55 plane1 city1)
   deleted: (in person55 plane1)
   added: (at person55 city1)
   goals met: 7 of 57
41. (board person37 plane1 city1)
   deleted: (at person37 city1)
   added: (in person37 plane1)
   goals met: 7 of 57
42. (board person15 plane1 city1)
   deleted: (at person15 city1)
   added: (in person15 plane1)
   goals met: 7 of 57
43. (board person14 plane1 city1)
   deleted: (at person14 city1)
   added: (in person14 plane1)
   goals met: 7 of 57
44. (refuel plane1 city1 fl1 fl2)
   deleted: (fuel-level plane1 fl1)
   added: (fuel-level plane1 fl2)
   goals met: 7 of 57
45. (fly plane1 city1 city9 fl2 fl1)
   deleted: (at_aircraft plane1 city1) (fuel-level plane1 fl2)
   added: (at_aircraft plane1 city9) (fuel-level plane1 fl1)
   goals met: 7 of 57
46. (board person54 plane1 city9)
   deleted: (at person54 city9)
   added: (in person54 plane1)
   goals met: 7 of 57
47. (debark person37 plane1 city9)
   deleted: (in person37 plane1)
   added: (at person37 city9)
   goals met: 8 of 57
48. (debark person32 plane1 city9)
   deleted: (in person32 plane1)
   added: (at person32 city9)
   goals met: 9 of 57
49. (board person27 plane1 city9)
   deleted: (at person27 city9)
   added: (in person27 plane1)
   goals met: 9 of 57
50. (board person12 plane1 city9)
   deleted: (at person12 city9)
   added: (in person12 plane1)
   goals met: 9 of 57
51. (refuel plane1 city9 fl1 fl2)
   deleted: (fuel-level plane1 fl1)
   added: (fuel-level plane1 fl2)
   goals met: 9 of 57
52. (fly plane1 city9 city4 fl2 fl1)
   deleted: (at_aircraft plane1 city9) (fuel-level plane1 fl2)
   added: (at_aircraft plane1 city4) (fuel-level plane1 fl1)
   goals met: 9 of 57
53. (board person5 plane1 city4)
   deleted: (at person5 city4)
   added: (in person5 plane1)
   goals met: 9 of 57
54. (board person49 plane1 city4)
   deleted: (at person49 city4)
   added: (in person49 plane1)
   goals met: 9 of 57
55. (board person36 plane1 city4)
   deleted: (at person36 city4)
   added: (in person36 plane1)
   goals met: 9 of 57
56. (debark person35 plane1 city4)
   deleted: (in person35 plane1)
   added: (at person35 city4)
   goals met: 10 of 57
57. (debark person12 plane1 city4)
   deleted: (in person12 plane1)
   added: (at person12 city4)
   goals met: 11 of 57
58. (refuel plane1 city4 fl1 fl2)
   deleted: (fuel-level plane1 fl1)
   added: (fuel-level plane1 fl2)
   goals met: 11 of 57
59. (fly plane1 city4 city18 fl2 fl1)
   deleted: (at_aircraft plane1 city4) (fuel-level plane1 fl2)
   added: (at_aircraft plane1 city18) (fuel-level plane1 fl1)
   goals met: 11 of 57
60. (board person7 plane1 city18)
   deleted: (at person7 city18)
   added: (in person7 plane1)
   goals met: 11 of 57
61. (board person6 plane1 city18)
   deleted: (at person6 city18)
   added: (in person6 plane1)
   goals met: 11 of 57
62. (board person46 plane1 city18)
   deleted: (at person46 city18)
   added: (in person46 plane1)
   goals met: 11 of 57
63. (debark person44 plane1 city18)
   deleted: (in person44 plane1)
   added: (at person44 city18)
   goals met: 12 of 57
64. (refuel plane1 city18 fl1 fl2)
   deleted: (fuel-level plane1 fl1)
   added: (fuel-level plane1 fl2)
   goals met: 12 of 57
65. (fly plane1 city18 city17 fl2 fl1)
   deleted: (at_aircraft plane1 city18) (fuel-level plane1 fl2)
   added: (at_aircraft plane1 city17) (fuel-level plane1 fl1)
   goals met: 12 of 57
66. (debark person7 plane1 city17)
   deleted: (in person7 plane1)
   added: (at person7 city17)
   goals met: 13 of 57
67. (board person48 plane1 city17)
   deleted: (at person48 city17)
   added: (in person48 plane1)
   goals met: 13 of 57
68. (debark person46 plane1 city17)
   deleted: (in person46 plane1)
   added: (at person46 city17)
   goals met: 14 of 57
69. (board person3 plane1 city17)
   deleted: (at person3 city17)
   added: (in person3 plane1)
   goals met: 14 of 57
70. (debark person21 plane1 city17)
   deleted: (in person21 plane1)
   added: (at person21 city17)
   goals met: 15 of 57
71. (debark person2 plane1 city17)
   deleted: (in person2 plane1)
   added: (at person2 city17)
   goals met: 16 of 57
72. (refuel plane1 city17 fl1 fl2)
   deleted: (fuel-level plane1 fl1)
   added: (fuel-level plane1 fl2)
   goals met: 16 of 57
73. (fly plane1 city17 city6 fl2 fl1)
   deleted: (at_aircraft plane1 city17) (fuel-level plane1 fl2)
   added: (at_aircraft plane1 city6) (fuel-level plane1 fl1)
   goals met: 16 of 57
74. (debark person53 plane1 city6)
   deleted: (in person53 plane1)
   added: (at person53 city6)
   goals met: 17 of 57
75. (board person50 plane1 city6)
   deleted: (at person50 city6)
   added: (in person50 plane1)
   goals met: 17 of 57
76. (board person23 plane1 city6)
   deleted: (at person23 city6)
   added: (in person23 plane1)
   goals met: 17 of 57
77. (debark person22 plane1 city6)
   deleted: (in person22 plane1)
   added: (at person22 city6)
   goals met: 18 of 57
78. (fly plane1 city6 city11 fl1 fl0)
   deleted: (at_aircraft plane1 city6) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city11) (fuel-level plane1 fl0)
   goals met: 18 of 57
79. (refuel plane1 city11 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 18 of 57
80. (board person34 plane1 city11)
   deleted: (at person34 city11)
   added: (in person34 plane1)
   goals met: 18 of 57
81. (board person33 plane1 city11)
   deleted: (at person33 city11)
   added: (in person33 plane1)
   goals met: 18 of 57
82. (debark person24 plane1 city11)
   deleted: (in person24 plane1)
   added: (at person24 city11)
   goals met: 19 of 57
83. (fly plane1 city11 city16 fl1 fl0)
   deleted: (at_aircraft plane1 city11) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city16) (fuel-level plane1 fl0)
   goals met: 19 of 57
84. (refuel plane1 city16 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 19 of 57
85. (board person26 plane1 city16)
   deleted: (at person26 city16)
   added: (in person26 plane1)
   goals met: 19 of 57
86. (fly plane1 city16 city3 fl1 fl0)
   deleted: (at_aircraft plane1 city16) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city3) (fuel-level plane1 fl0)
   goals met: 19 of 57
87. (refuel plane1 city3 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 19 of 57
88. (board person56 plane1 city3)
   deleted: (at person56 city3)
   added: (in person56 plane1)
   goals met: 19 of 57
89. (debark person14 plane1 city3)
   deleted: (in person14 plane1)
   added: (at person14 city3)
   goals met: 20 of 57
90. (board person13 plane1 city3)
   deleted: (at person13 city3)
   added: (in person13 plane1)
   goals met: 20 of 57
91. (board person10 plane1 city3)
   deleted: (at person10 city3)
   added: (in person10 plane1)
   goals met: 20 of 57
92. (fly plane1 city3 city0 fl1 fl0)
   deleted: (at_aircraft plane1 city3) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city0) (fuel-level plane1 fl0)
   goals met: 20 of 57
93. (refuel plane5 city1 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 20 of 57
94. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 20 of 57
95. (debark person5 plane1 city0)
   deleted: (in person5 plane1)
   added: (at person5 city0)
   goals met: 21 of 57
96. (debark person36 plane1 city0)
   deleted: (in person36 plane1)
   added: (at person36 city0)
   goals met: 22 of 57
97. (fly plane1 city0 city1 fl1 fl0)
   deleted: (at_aircraft plane1 city0) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city1) (fuel-level plane1 fl0)
   goals met: 22 of 57
98. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 22 of 57
99. (debark person54 plane1 city1)
   deleted: (in person54 plane1)
   added: (at person54 city1)
   goals met: 23 of 57
100. (debark person48 plane1 city1)
   deleted: (in person48 plane1)
   added: (at person48 city1)
   goals met: 24 of 57
101. (debark person13 plane1 city1)
   deleted: (in person13 plane1)
   added: (at person13 city1)
   goals met: 25 of 57
102. (fly plane1 city1 city10 fl1 fl0)
   deleted: (at_aircraft plane1 city1) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city10) (fuel-level plane1 fl0)
   goals met: 25 of 57
103. (refuel plane1 city10 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 25 of 57
104. (debark person57 plane1 city10)
   deleted: (in person57 plane1)
   added: (at person57 city10)
   goals met: 26 of 57
105. (board person47 plane1 city10)
   deleted: (at person47 city10)
   added: (in person47 plane1)
   goals met: 26 of 57
106. (fly plane1 city10 city12 fl1 fl0)
   deleted: (at_aircraft plane1 city10) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city12) (fuel-level plane1 fl0)
   goals met: 26 of 57
107. (refuel plane1 city12 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 26 of 57
108. (debark person9 plane1 city12)
   deleted: (in person9 plane1)
   added: (at person9 city12)
   goals met: 27 of 57
109. (debark person6 plane1 city12)
   deleted: (in person6 plane1)
   added: (at person6 city12)
   goals met: 28 of 57
110. (debark person45 plane1 city12)
   deleted: (in person45 plane1)
   added: (at person45 city12)
   goals met: 29 of 57
111. (debark person1 plane1 city12)
   deleted: (in person1 plane1)
   added: (at person1 city12)
   goals met: 30 of 57
112. (fly plane1 city12 city13 fl1 fl0)
   deleted: (at_aircraft plane1 city12) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city13) (fuel-level plane1 fl0)
   goals met: 30 of 57
113. (refuel plane1 city13 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 30 of 57
114. (debark person59 plane1 city13)
   deleted: (in person59 plane1)
   added: (at person59 city13)
   goals met: 31 of 57
115. (debark person26 plane1 city13)
   deleted: (in person26 plane1)
   added: (at person26 city13)
   goals met: 32 of 57
116. (fly plane1 city13 city15 fl1 fl0)
   deleted: (at_aircraft plane1 city13) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city15) (fuel-level plane1 fl0)
   goals met: 32 of 57
117. (refuel plane1 city15 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 32 of 57
118. (debark person33 plane1 city15)
   deleted: (in person33 plane1)
   added: (at person33 city15)
   goals met: 33 of 57
119. (debark person3 plane1 city15)
   deleted: (in person3 plane1)
   added: (at person3 city15)
   goals met: 34 of 57
120. (debark person27 plane1 city15)
   deleted: (in person27 plane1)
   added: (at person27 city15)
   goals met: 35 of 57
121. (fly plane1 city15 city16 fl1 fl0)
   deleted: (at_aircraft plane1 city15) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city16) (fuel-level plane1 fl0)
   goals met: 35 of 57
122. (refuel plane1 city16 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 35 of 57
123. (debark person10 plane1 city16)
   deleted: (in person10 plane1)
   added: (at person10 city16)
   goals met: 36 of 57
124. (fly plane1 city16 city18 fl1 fl0)
   deleted: (at_aircraft plane1 city16) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city18) (fuel-level plane1 fl0)
   goals met: 36 of 57
125. (refuel plane1 city18 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 36 of 57
126. (debark person47 plane1 city18)
   deleted: (in person47 plane1)
   added: (at person47 city18)
   goals met: 37 of 57
127. (fly plane1 city18 city5 fl1 fl0)
   deleted: (at_aircraft plane1 city18) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city5) (fuel-level plane1 fl0)
   goals met: 37 of 57
128. (refuel plane1 city5 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 37 of 57
129. (debark person52 plane1 city5)
   deleted: (in person52 plane1)
   added: (at person52 city5)
   goals met: 38 of 57
130. (debark person19 plane1 city5)
   deleted: (in person19 plane1)
   added: (at person19 city5)
   goals met: 39 of 57
131. (debark person16 plane1 city5)
   deleted: (in person16 plane1)
   added: (at person16 city5)
   goals met: 40 of 57
132. (fly plane1 city5 city7 fl1 fl0)
   deleted: (at_aircraft plane1 city5) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city7) (fuel-level plane1 fl0)
   goals met: 40 of 57
133. (refuel plane1 city7 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 40 of 57
134. (debark person43 plane1 city7)
   deleted: (in person43 plane1)
   added: (at person43 city7)
   goals met: 41 of 57
135. (debark person15 plane1 city7)
   deleted: (in person15 plane1)
   added: (at person15 city7)
   goals met: 42 of 57
136. (fly plane1 city7 city8 fl1 fl0)
   deleted: (at_aircraft plane1 city7) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city8) (fuel-level plane1 fl0)
   goals met: 42 of 57
137. (refuel plane1 city8 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 42 of 57
138. (debark person58 plane1 city8)
   deleted: (in person58 plane1)
   added: (at person58 city8)
   goals met: 43 of 57
139. (board person39 plane1 city8)
   deleted: (at person39 city8)
   added: (in person39 plane1)
   goals met: 43 of 57
140. (board person11 plane1 city8)
   deleted: (at person11 city8)
   added: (in person11 plane1)
   goals met: 43 of 57
141. (fly plane1 city8 city11 fl1 fl0)
   deleted: (at_aircraft plane1 city8) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city11) (fuel-level plane1 fl0)
   goals met: 43 of 57
142. (refuel plane1 city11 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 43 of 57
143. (debark person11 plane1 city11)
   deleted: (in person11 plane1)
   added: (at person11 city11)
   goals met: 44 of 57
144. (fly plane1 city11 city3 fl1 fl0)
   deleted: (at_aircraft plane1 city11) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city3) (fuel-level plane1 fl0)
   goals met: 44 of 57
145. (refuel plane1 city3 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 44 of 57
146. (debark person39 plane1 city3)
   deleted: (in person39 plane1)
   added: (at person39 city3)
   goals met: 45 of 57
147. (fly plane1 city3 city9 fl1 fl0)
   deleted: (at_aircraft plane1 city3) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city9) (fuel-level plane1 fl0)
   goals met: 45 of 57
148. (refuel plane1 city9 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 45 of 57
149. (debark person50 plane1 city9)
   deleted: (in person50 plane1)
   added: (at person50 city9)
   goals met: 46 of 57
150. (debark person49 plane1 city9)
   deleted: (in person49 plane1)
   added: (at person49 city9)
   goals met: 47 of 57
151. (debark person34 plane1 city9)
   deleted: (in person34 plane1)
   added: (at person34 city9)
   goals met: 48 of 57
152. (debark person23 plane1 city9)
   deleted: (in person23 plane1)
   added: (at person23 city9)
   goals met: 49 of 57
153. (fly plane1 city9 city19 fl1 fl0)
   deleted: (at_aircraft plane1 city9) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city19) (fuel-level plane1 fl0)
   goals met: 49 of 57
154. (refuel plane1 city19 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 49 of 57
155. (debark person60 plane1 city19)
   deleted: (in person60 plane1)
   added: (at person60 city19)
   goals met: 50 of 57
156. (debark person56 plane1 city19)
   deleted: (in person56 plane1)
   added: (at person56 city19)
   goals met: 51 of 57
157. (board person41 plane1 city19)
   deleted: (at person41 city19)
   added: (in person41 plane1)
   goals met: 51 of 57
158. (board person40 plane1 city19)
   deleted: (at person40 city19)
   added: (in person40 plane1)
   goals met: 51 of 57
159. (board person20 plane1 city19)
   deleted: (at person20 city19)
   added: (in person20 plane1)
   goals met: 51 of 57
160. (fly plane1 city19 city2 fl1 fl0)
   deleted: (at_aircraft plane1 city19) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city2) (fuel-level plane1 fl0)
   goals met: 51 of 57
161. (refuel plane1 city2 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 51 of 57
162. (board person51 plane1 city2)
   deleted: (at person51 city2)
   added: (in person51 plane1)
   goals met: 51 of 57
163. (debark person41 plane1 city2)
   deleted: (in person41 plane1)
   added: (at person41 city2)
   goals met: 52 of 57
164. (board person38 plane1 city2)
   deleted: (at person38 city2)
   added: (in person38 plane1)
   goals met: 52 of 57
165. (board person17 plane1 city2)
   deleted: (at person17 city2)
   added: (in person17 plane1)
   goals met: 52 of 57
166. (fly plane1 city2 city1 fl1 fl0)
   deleted: (at_aircraft plane1 city2) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city1) (fuel-level plane1 fl0)
   goals met: 52 of 57
167. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 52 of 57
168. (debark person40 plane1 city1)
   deleted: (in person40 plane1)
   added: (at person40 city1)
   goals met: 53 of 57
169. (fly plane1 city1 city10 fl1 fl0)
   deleted: (at_aircraft plane1 city1) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city10) (fuel-level plane1 fl0)
   goals met: 53 of 57
170. (refuel plane1 city10 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 53 of 57
171. (debark person38 plane1 city10)
   deleted: (in person38 plane1)
   added: (at person38 city10)
   goals met: 54 of 57
172. (fly plane1 city10 city4 fl1 fl0)
   deleted: (at_aircraft plane1 city10) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city4) (fuel-level plane1 fl0)
   goals met: 54 of 57
173. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 54 of 57
174. (debark person17 plane1 city4)
   deleted: (in person17 plane1)
   added: (at person17 city4)
   goals met: 55 of 57
175. (fly plane1 city4 city8 fl1 fl0)
   deleted: (at_aircraft plane1 city4) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city8) (fuel-level plane1 fl0)
   goals met: 55 of 57
176. (debark person51 plane1 city8)
   deleted: (in person51 plane1)
   added: (at person51 city8)
   goals met: 56 of 57
177. (debark person20 plane1 city8)
   deleted: (in person20 plane1)
   added: (at person20 city8)
   goals met: 57 of 57
